Revit 2027 API
ParameterTypeId.Profile2OffsetX Property
 "Horizontal Profile Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Profile2OffsetX { get; }
Public Shared ReadOnly Property Profile2OffsetX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Profile2OffsetX {
	ForgeTypeId^ get ();
}
static member Profile2OffsetX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace